app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"   ORDER BY name asc
---
	def index
		@tasks = Task.all

INSERT INTO "tasks" ("created_at", "description", "due", "priority", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-06-26 15:37:58.938486"], ["description", "#"], ["due", "2014-06-26 15:37:00.000000"], ["priority", 0], ["title", "#"], ["updated_at", "2014-06-26 15:37:58.938486"]]
---
	def create
		#render plain: params[:task].inspect
		@task = Task.new(task_params)
		if @task.save

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 14]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 14]]
---
	def edit
		@task = Task.find(params[:id])
		@task.destroy